In [1]:
# pandas, numpy 문서!

In [2]:
import pandas as pd
import numpy as np

# index_col

In [9]:
pd.read_csv('test_text.txt', sep='|')
# 디폴트 행 인덱스 : 0번 ~
pd.read_csv('test_text.txt', sep='|', index_col='ID')
pd.read_csv('test_text.txt', sep='|', index_col=0)

   LAST_NAME  AGE
ID
1        KIM   25
2        LEE   22
3       PARK   33
4       CHOI   24
5       CHOI   30

# header

In [14]:
pd.read_csv('test_text_without_name.txt', sep='|', index_col=0)
# 디폴트 설정 -> header = 있음
pd.read_csv('test_text_without_name.txt', sep='|', index_col=0, header=None)

      1   2
0
1   KIM  25
2   LEE  22
3  PARK  33
4  CHOI  24
5  CHOI  30

# skiprows
: 줄을 건너 뛸 경우

In [29]:
pd.read_csv('test_text.txt', sep='|', skiprows=0)
pd.read_csv('test_text.txt', sep='|',skiprows=[1,3])

   ID LAST_NAME  AGE
0   2       LEE   22
1   4      CHOI   24
2   5      CHOI   30

# nrow

In [36]:
data = pd.read_csv('test_text.txt', sep='|',nrows=3)
# 3줄만 불러오기
data.info()  # R의 str함수

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
ID           3 non-null int64
LAST_NAME    3 non-null object
AGE          3 non-null int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

# 결측값(na)

In [38]:
data = pd.read_csv('test_text_na.txt', sep='|')
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int64
LAST_NAME    5 non-null object
AGE          5 non-null object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

   ID LAST_NAME AGE
0   1       KIM  25
1   2       LEE  없음
2   3      PARK  33
3   4        모름  24
4   5      CHOI  30

In [41]:
data = pd.read_csv('test_text_na.txt', sep='|', na_values=['없음','모름'])
data.info()
data
# NaN (not a number)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int64
LAST_NAME    4 non-null object
AGE          4 non-null float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

   ID LAST_NAME   AGE
0   1       KIM  25.0
1   2       LEE   NaN
2   3      PARK  33.0
3   4       NaN  24.0
4   5      CHOI  30.0

# dtype : 데이터 타입 지정

In [45]:
data = pd.read_csv('test_text.txt', sep='|',
                  dtype={'ID':int,
                        'LAST_NAME':str,
                        'AGE':str})
data.info()
data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
ID           5 non-null int32
LAST_NAME    5 non-null object
AGE          5 non-null object
dtypes: int32(1), object(2)
memory usage: 228.0+ bytes

   ID LAST_NAME AGE
0   1       KIM  25
1   2       LEE  22
2   3      PARK  33
3   4      CHOI  24
4   5      CHOI  30

# to_csv
: 데이터프레임을 csv로 저장

In [52]:
from pandas import DataFrame

# 딕셔너리 데이터로 데이터프레임 생성하기
df=DataFrame({
    'id':['a1','a2','a3','a4','a5'],
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
})
df

   id  x1   x2
0  a1   1  1.1
1  a2   2  2.2
2  a3   3  3.3
3  a4   4  4.4
4  a5   5  5.5

# 딕셔너리 데이터로 데이터프레임 생성하기

In [55]:
from pandas import DataFrame

# 딕셔너리 데이터로 데이터프레임 생성하기
df=DataFrame({  # data={}
    'id':['a1','a2','a3','a4','a5'],
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
}, index=['a','b','c','d','e'])

df

   id  x1   x2
a  a1   1  1.1
b  a2   2  2.2
c  a3   3  3.3
d  a4   4  4.4
e  a5   5  5.5

In [63]:
from pandas import DataFrame

df=DataFrame({ 
    'id':['a1','a2','a3','a4','a5'],
    'x1':[1,2,3,4,5],
    'x2':[1.1,2.2,3.3,4.4,5.5]
}, index=['a','b','c','d','e'])
df
# 결측값으로 구성된 새로운 행 추가
df2 = df.reindex(['a','b','c','d','e','f'])
df2
df.reindex(['a','k','c','e','f'])

    id   x1   x2
a   a1  1.0  1.1
k  NaN  NaN  NaN
c   a3  3.0  3.3
e   a5  5.0  5.5
f  NaN  NaN  NaN

In [66]:
df2.to_csv('df3.csv', sep='$')

In [71]:
# na_rep : na를 표시하겠느냐
df2.to_csv('df4.csv', na_rep='NaN',float_format='%.2f')
df2

    id   x1   x2
a   a1  1.0  1.1
b   a2  2.0  2.2
c   a3  3.0  3.3
d   a4  4.0  4.4
e   a5  5.0  5.5
f  NaN  NaN  NaN

In [74]:
# 원하는 col만 저장
df2.to_csv('df5.csv', na_rep='NaN', columns=['id','x2'])

In [75]:
df2.to_csv('df6.csv', na_rep='NaN', columns=['id','x2'], index=False)

# array를 이용해 데이터프레임 만들기

In [76]:
from pandas import DataFrame as df
# 
df(data=np.arange)

In [112]:
np.arange(8).shape
np.arange(8).reshape(2,4)
np.arange(8).reshape(2,2,2)
np.arange(1,9).reshape(2,2,2)

# array를 이용해 데이터프레임 만들기
df1=df(data = np.arange(8).reshape(4,2),
    columns=['ID','x1'],
   index=[1,2,3,4]
  )

# transpose matrix
: 전치행렬

In [113]:
df1

   ID  x1
1   0   1
2   2   3
3   4   5
4   6   7

In [115]:
df1.T

   ID  x1
1   0   1
2   2   3
3   4   5
4   6   7

In [129]:
# axis(축, 단수), axes(축들, 복수)
df1.axes  # 행과 열에 대한 인덱스들을 보여줌
df1.dtypes
df1.info()
df1.shape
df1.size  # 4행*2열
df1.values

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1 to 4
Data columns (total 2 columns):
ID    4 non-null int32
x1    4 non-null int32
dtypes: int32(2)
memory usage: 224.0 bytes

array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7]])

In [231]:
# 정규분포(평균:0, 표준편차:1)를 따르는 난수 생성
np.random.randn(5)

array([ 0.36422353, -0.49719805, -1.86050207, -0.43027217,  0.34528721])

In [262]:
df = DataFrame({
    'cls_1':['a','a','b','b','c'],
    'v1':np.arange(5),
    'v2':np.random.randn(5)
}, index=['r0','r1','r2','r3','r4',])

In [263]:
df

   cls_1  v1        v2
r0     a   0  2.136003
r1     a   1  0.209421
r2     b   2  0.996853
r3     b   3 -1.148863
r4     c   4 -0.531102

# ix
: 행 단위 indexing할 때, 행위치(정수)와 행 인덱스 이름을 모두 사용할 수 있다.

In [278]:
# 경고창을 무시하기 위한 문장
import warnings
warnings.filterwarnings(action='ignore')

df.ix[2]  # 0번 인덱스부터 시작 // 2번 인덱스 행 호출
df.ix['r2']  # 행 인덱스가 r2인 행 출력
df.ix['r3':]
df.ix[3:]

# ix, loc, iloc

   cls_1  v1        v2
r3     b   3 -1.148863
r4     c   4 -0.531102

# 원하는 행 열 추출

In [301]:
df
df.head(3)  # 위에서부터 n개 출력
df.tail(3)  # 아래에서부터 n개 출력

df['cls_1'] # 원하는 열 하나 추출
df.cls_1    # 원하는 열 하나 추출
df[['cls_1','v1']] # 원하는 여러 열 추출
type(df[['cls_1','v1']]) # dataframe

pandas.core.frame.DataFrame

In [302]:
df['cls_1']
type(df['cls_1'])  # series

pandas.core.series.Series

# 결측값 대체

In [303]:
df = DataFrame({
    'cls_1':['a','a','b','b','c'],
    'v1':np.arange(5),
    'v2':np.random.randn(5)
}, index=['r0','r1','r2','r3','r4'])
df

   cls_1  v1        v2
r0     a   0  0.721283
r1     a   1 -1.238701
r2     b   2  0.190942
r3     b   3 -0.969755
r4     c   4 -0.356332

In [311]:
# fill_value : NaN값을 대체
df.reindex(['r0','r1','r2','r5','r6'],fill_value=0)
df.reindex(['r0','r1','r2','r5','r6'],fill_value='missing')
df.reindex(['r0','r1','r2','r5','r6'],fill_value='NA')

   cls_1  v1        v2
r0     a   0  0.721283
r1     a   1   -1.2387
r2     b   2  0.190942
r5    NA  NA        NA
r6    NA  NA        NA

# 시계열 데이터
:DataFrame에서 index를 만들때 date_range함수를 이용해

In [ ]:
'''freq='D'
freq='M'
freq='Y'
freq='H''''

In [323]:
date_idx = pd.date_range('1/7/2020',periods=5,freq='D')  # date_range(시작일, periods=n)

df2 = pd.DataFrame({
    'c1':[5,3,7,6,4]
},index = date_idx)
df2

            c1
2020-01-07   5
2020-01-08   3
2020-01-09   7
2020-01-10   6
2020-01-11   4

In [332]:
                            # 시작일        개수      종류
date_idx2 = pd.date_range('12/31/2019',periods=20,freq='D')

# <<< error >>>
# df3 = pd.DataFrame({
#     'c1':[5,3,7,6,4]
# },index = date_idx2)
# df3

# ffill, bfill
df2.reindex(date_idx2, method='bfill')  # fill_value=0
df2.reindex(date_idx2, method='ffill')

             c1
2019-12-31  NaN
2020-01-01  NaN
2020-01-02  NaN
2020-01-03  NaN
2020-01-04  NaN
2020-01-05  NaN
2020-01-06  NaN
2020-01-07  5.0
2020-01-08  3.0
2020-01-09  7.0
2020-01-10  6.0
2020-01-11  4.0
2020-01-12  4.0
2020-01-13  4.0
2020-01-14  4.0
2020-01-15  4.0
2020-01-16  4.0
2020-01-17  4.0
2020-01-18  4.0
2020-01-19  4.0